01  RLHL-HEADER-RECORD.                                          
       05  RLHL-FILE-ID                     PIC  X(08).             
       05  RLHL-LOGICAL-RECORD              PIC  X(04).             
       05  RLHL-RECORD-COUNT                PIC S9(08) COMP.        
       05  RLHL-RECORD-LENGTH               PIC S9(04) COMP.        
       05  RLHL-KEY-OFFSET                  PIC S9(04) COMP.        
       05  RLHL-KEY-LENGTH                  PIC S9(04) COMP.        
       05  RLHL-DSAM-FLAG                   PIC  X(01).             
       05  RLHL-EFFECTIVE-DATE-FLAG         PIC  X(01).             
       05  RLHL-RECORDS-ABOVE               PIC S9(08) COMP.        
       05  RLHL-RECORDS-BELOW               PIC S9(08) COMP.        
       05  RLHL-START-DATE-OFFSET           PIC S9(04) COMP.        
       05  RLHL-END-DATE-OFFSET             PIC S9(04) COMP.        
       05  FILLER                           PIC  X(64).             
                                                                   