       01  DECIMALS-RECORD.
              05  SNINES-WITH-V           PIC S999999V99999.
              05  SBRACKETED-NINES        PIC S9(5)V9(3).       
              05  NINES-WITH-V            PIC 999999V99999.
              05  BRACKETED-NINES         PIC 9(5)V9(3).
              05  BRACKET-V-NINES         PIC S9(9)V99   COMP-3.
              05  SNINES-WITH-V-C3        PIC S99999V99999 COMP-3.
