               05  CURRENT-PRIOR-INDICATOR PIC X.                       00046903
               05  TABLE-ID                PIC XX.                      00046904
               05  EFFECTIVE-DATE.                                      00046908
                   10  MONTH               PIC XX.                      00046909
                   10  DAYS                PIC XX.                      00046910
                   10  CENTURY             PIC XX.                      00046920
                   10  YEAR                PIC XX.                      00046930
               05  FILLER                  PIC X(13).                   00046940
               05  OFFICE                  PIC XX.                      00046950
               05  FILLER                  PIC X(4).                    00046960
               05  ENTRY-DATE.                                          00046970
                   10  MONTH               PIC XX.                      00046980
                   10  DAYS                PIC XX.                      00046990
                   10  YEAR                PIC XX.                      00047000
               05  CLOSE-DATE.                                          00047100
                   10  MONTH               PIC XX.                      00047200
                   10  DAYS                PIC XX.                      00047300
                   10  CENTURY             PIC XX.                      00047400
                   10  YEAR                PIC XX.                      00047500
               05  RECEIVING-UNIT          PIC XX.                      00047600
               05  FILLER                  PIC X(59).                   00047700
