000010***************************************************************
000020**                                                            *
000150***************************************************************
000160*01  COMMENTED_RECORD.
000170     05 SPLIT_NUM.
000180        10 CEN                     PIC X(02).
000190        10 YR                      PIC X(02).
000200        10                         PIC X.
000210        10 MONTH                   PIC X(02).
000220        10                         PIC X.
000230        10 DAY                     PIC X(02).
000240     05 LOTS_OF_OTHER_STUFF     PIC X(99).
