       * TRAIN6 EXAMPLE COBOL COPYBOOK
        01 ONE_LINE.                                                  
           05  ACCOUNT_NO                  PIC X(9).