01  RUBBISH-RECORD.
       05  LAST-NAME               PIC X(15).
       05  FIRST-NAME              PIC X(8).
       05  STREET-ADDRESS          PIC X(20).
       05  CITY       rubbish      PIC X(17).
       05  STATE                   PIC XX.
       05  ZIP-CODE                PIC 9(5).
       05  FILLER                  PC X(10.