       01  CUSTOMER-RECORD.
              05  LAST-NAME               PIC X(15).
              05  FIRST-NAME              PIC X(8).
              05  STREET-ADDRESS          PIC X(20).
              05  CITY                    PIC X(17).
              05  STATE                   PIC XX.
              05  AMOUNT                  PIC S9(5).
              05  UNSIGN                  PIC 9(5).
              05  FILLER                  PIC X(10).