       01  CUSTOMER-RECORD.
              05  LAST-NAME               PIC X(15).
              05  FIRST-NAME              PIC X(8).
              05  STREET-ADDRESS          PIC X(20).
              05  CITY                    PIC X(17).
              05  STATE                   PIC XX      COMP-5.
              05  ZIP-CODE                PIC 9(5)    COMP-3.
              05  FILLER                  PIC X(10).